УТ/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьСвязанныеДиалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЧекЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаВыполненияЧекЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Enums/CRM_ВидыСостоянияИнтереса/CRM_ВидыСостоянияИнтереса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ВидыСостоянияИнтереса</name>
  <enumValues>
    <name>Первое</name>
  </enumValues>
  <enumValues>
    <name>УспешноеЗавершение</name>
  </enumValues>
  <enumValues>
    <name>НеудачноеЗавершение</name>
  </enumValues>
</mdclass:Enum>

УТ/src/Catalogs/CRM_СостоянияИнтересов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Родитель) Тогда
		ЭтоПоддержка = Родитель.ЭтоПоддержка;
	КонецЕсли;
	
	Если ЭтоНовый() И ЗначениеЗаполнено(Родитель) И Не ЗначениеЗаполнено(ВидСостояния)
		И Не ДополнительныеСвойства.Свойство("РеквизитаУпорядочиванияУстановлен") Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	МАКСИМУМ(CRM_СостоянияИнтересов.РеквизитДопУпорядочивания) КАК РеквизитДопУпорядочивания
		                      |ИЗ
		                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
		                      |ГДЕ
		                      |	НЕ CRM_СостоянияИнтересов.Завершено
		                      |	И CRM_СостоянияИнтересов.Родитель = &Родитель");
		
		Запрос.УстановитьПараметр("Родитель", Родитель);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДополнительныеСвойства.Вставить("РеквизитаУпорядочиванияУстановлен", Истина);
			РеквизитДопУпорядочивания = Выборка.РеквизитДопУпорядочивания + 1;
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЭтоНовый() И ЗначениеЗаполнено(Родитель) Тогда
		Если ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.Первое И РеквизитДопУпорядочивания <> 1 Тогда
			РеквизитДопУпорядочивания = 1;
		ИначеЕсли ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение
			 И РеквизитДопУпорядочивания <> 98 Тогда
			РеквизитДопУпорядочивания = 98;
		ИначеЕсли ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение
			 И РеквизитДопУпорядочивания <> 99 Тогда
			РеквизитДопУпорядочивания = 99;
		ИначеЕсли ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.ПустаяСсылка()
			 И (РеквизитДопУпорядочивания < 2
			 ИЛИ РеквизитДопУпорядочивания > 97) Тогда
			РеквизитДопУпорядочивания = Ссылка.РеквизитДопУпорядочивания;
		КонецЕсли;
	КонецЕсли;
	Если ПометкаУдаления Тогда
		Если ЗначениеЗаполнено(Родитель) И ЗначениеЗаполнено(ВидСостояния) И НЕ Родитель.ПометкаУдаления Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя пометить на удаление основные состояния сценария!';
				|en='You can not mark the basic states of the script for deletion!'"));
		Иначе
			Используется = Ложь;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ВидСостояния) Тогда	
		Используется = Истина;
	КонецЕсли;
	Если ЭтоНовый() И ЗначениеЗаполнено(Родитель) И Не ЗначениеЗаполнено(ИндексЦвета) Тогда
		Если ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.УспешноеЗавершение Тогда
			ИндексЦвета = 19;
		ИначеЕсли ВидСостояния = Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
			ИндексЦвета = 15;
		Иначе
			СписокЦветовПоУмолчанию = CRM_ОбщегоНазначенияКлиентСервер.ПолучитьСписокЦветовПоУмолчанию();
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	CRM_СостоянияИнтересов.ИндексЦвета КАК ИндексЦвета
			                      |ИЗ
			                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
			                      |ГДЕ
			                      |	CRM_СостоянияИнтересов.Родитель = &Родитель");
			Запрос.УстановитьПараметр("Родитель", Родитель);
			Выборка = Запрос.Выполнить().Выбрать();
			Для каждого ЦветПоУмолчанию Из СписокЦветовПоУмолчанию Цикл
				Если НЕ Выборка.НайтиСледующий(Новый Структура("ИндексЦвета", ЦветПоУмолчанию.Значение)) Тогда
					ИндексЦвета = ЦветПоУмолчанию.Значение;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если Не ЗначениеЗаполнено(ИндексЦвета) Тогда
				ИндексЦвета = 17;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Родитель) Тогда
		МассивПроверяемыхРеквизитов = ПроверяемыеРеквизитыИнтереса.Получить();
		ПроверяемыеРеквизитыИнтересаПредставление = "";
		Если НЕ (МассивПроверяемыхРеквизитов = Неопределено Или МассивПроверяемыхРеквизитов.Количество() = 0) Тогда
			Для каждого ПроверяемыйРеквизит Из МассивПроверяемыхРеквизитов Цикл
				Если ТипЗнч(ПроверяемыйРеквизит) = Тип("Строка") Тогда
					РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти(ПроверяемыйРеквизит);
					ТабличнаяЧастьМД = Метаданные.Документы.CRM_Интерес.ТабличныеЧасти.Найти(ПроверяемыйРеквизит);
					Если РеквизитМД <> Неопределено Тогда
						ПроверяемыеРеквизитыИнтересаПредставление = ПроверяемыеРеквизитыИнтересаПредставление +
							РеквизитМД.Синоним + "; ";
					ИначеЕсли ТабличнаяЧастьМД <> Неопределено Тогда
						ПроверяемыеРеквизитыИнтересаПредставление = ПроверяемыеРеквизитыИнтересаПредставление +
							ТабличнаяЧастьМД.Синоним + "; ";
					КонецЕсли;
				Иначе
					ПроверяемыеРеквизитыИнтересаПредставление = ПроверяемыеРеквизитыИнтересаПредставление +
						ПроверяемыйРеквизит.Заголовок + "; ";
				КонецЕсли;
			КонецЦикла;
			ПроверяемыеРеквизитыИнтересаПредставление = Лев(ПроверяемыеРеквизитыИнтересаПредставление,
				СтрДлина(ПроверяемыеРеквизитыИнтересаПредставление) - 2);
		КонецЕсли;
		
		МассивБлокируемыхРеквизитов = БлокируемыеРеквизитыИнтереса.Получить();
		БлокируемыеРеквизитыИнтересаПредставление = "";
		Если НЕ (МассивБлокируемыхРеквизитов = Неопределено Или МассивБлокируемыхРеквизитов.Количество() = 0) Тогда
			Для каждого БлокируемыйРеквизит Из МассивБлокируемыхРеквизитов Цикл
				Если ТипЗнч(БлокируемыйРеквизит) = Тип("Строка") Тогда
					РеквизитМД = Метаданные.Документы.CRM_Интерес.Реквизиты.Найти(БлокируемыйРеквизит);
					ТабличнаяЧастьМД = Метаданные.Документы.CRM_Интерес.ТабличныеЧасти.Найти(БлокируемыйРеквизит);
					Если РеквизитМД <> Неопределено Тогда
						БлокируемыеРеквизитыИнтересаПредставление = БлокируемыеРеквизитыИнтересаПредставление +
							РеквизитМД.Синоним + "; ";
					ИначеЕсли ТабличнаяЧастьМД <> Неопределено Тогда
						БлокируемыеРеквизитыИнтересаПредставление = БлокируемыеРеквизитыИнтересаПредставление +
							ТабличнаяЧастьМД.Синоним + "; ";
					КонецЕсли;
				Иначе
					БлокируемыеРеквизитыИнтересаПредставление = БлокируемыеРеквизитыИнтересаПредставление +
						БлокируемыйРеквизит.Заголовок + "; ";
				КонецЕсли;
			КонецЦикла;
			БлокируемыеРеквизитыИнтересаПредставление = Лев(БлокируемыеРеквизитыИнтересаПредставление,
				СтрДлина(БлокируемыеРеквизитыИнтересаПредставление) - 2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоПоддержка Тогда
		Если Не ДополнительныеСвойства.Свойство("НеОбновлятьВоронкуПродаж")
			 И ВидСостояния <> Перечисления.CRM_ВидыСостоянияИнтереса.НеудачноеЗавершение Тогда
			Справочники.CRM_ВоронкиПродаж.ОбновитьВоронкуПродаж(Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.ЭтоНовый
		 И Не ДополнительныеСвойства.Свойство("НеСоздаватьОбязательные")
		 И Не ЗначениеЗаполнено(Родитель) Тогда
		Справочники.CRM_СостоянияИнтересов.СоздатьОбязательныеСостоянияСценария(Ссылка, ЭтоПоддержка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ЗначениеЗаполнено(ЗавершатьЗапланированныеАктивности) Тогда
		ПроверяемыеРеквизиты.Добавить("ОтборЗавершаемыхАктивностей");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid call of object on client.'");
#КонецЕсли
